app/Http/Controllers/AdminController.php

select * from `categories` order by `id` desc
---
    public function categories()
    {
        $categories = Category::query()->orderBy('id', 'DESC')->get();

select * from `goods` order by `id` desc
---
    public function goods()
    {
        $goods = Good::query()->orderBy('id', 'DESC')->get();