app/Http/Controllers/CategoryController.php

select * from `categories` where `categories`.`id` = '11' limit 1
---
    function edit($id)
    {
        $category = Category::query()->find($id);

select * from `categories` where `categories`.`id` = '4' limit 1
update `categories` set `title` = '1Управленческо-экономические', `description` = 'Игры на просчет последствий и рисков, распределение и торговля ресурсами. Игровая среда — текстовый диалог.', `categories`.`updated_at` = '2021-12-24 15:36:28' where `id` = 4
---
    function save(GoodRequest $request)
    {
        $category = Category::query()->find($request->id);
        $category->title = $request->title;
        $category->description = $request->description;
        $category->save();