app/Http/Controllers/GoodController.php

    public function good(int $id)
    {
        /** @var Good $good */
        $good = Good::query()->with('category')->find($id);
---
select * from `categories` where `categories`.`id` in (1)
select * from `goods` where `goods`.`id` = 1 limit 1

    public function category(int $id)
    {
        /** @var Category $category */
        $goods = Good::query()->where('category_id', '=', $id)->paginate(6);
        return view('home', [
            'goods' => $goods,
            'categories' => Category::all(),
---
select count(*) as aggregate from `goods` where `category_id` = 3
select * from `categories`

    function edit($id)
    {
        $good = Good::query()->find($id);
---
select * from `goods` where `goods`.`id` = '2' limit 1